[
  {
    "title": "JavaScript: The Good Parts",
    "author": "Douglas Crockford",
    "genre": "coding",
    "edition": "1st",
    "description": "Describes the reliable features of JavaScript, covering such topics as syntax, objects, functions, arrays, regular expressions, inheritance, and methods.",
    "stock": 15,
    "image": "https://m.media-amazon.com/images/I/41w+nN8Kg0L._SY445_SX342_.jpg",
    "borrow_count": 0
  },
  {
    "title": "Clean Code: A Handbook of Agile Software Craftsmanship",
    "author": "Robert C. Martin",
    "genre": "coding",
    "edition": "1st",
    "description": "Even bad code can function. But if code isn’t clean, it can bring a development organization to its knees. Every year, countless hours and significant resources are lost because of poorly written code. But it doesn’t have to be that way.",
    "stock": 8,
    "image": "https://m.media-amazon.com/images/I/41bOkXnNBjL._SY445_SX342_.jpg",
    "borrow_count": 0
  },
  {
    "title": "Design Patterns: Elements of Reusable Object-Oriented Software",
    "author": "Erich Gamma, Richard Helm, Ralph Johnson, John Vlissides",
    "genre": "coding",
    "edition": "1st",
    "description": "Capturing a wealth of experience about the design of object-oriented software, four top-notch designers present a catalog of simple and succinct solutions to commonly occurring design problems. Previously undocumented, these 23 patterns allow designers to create more flexible, elegant, and ultimately reusable designs without having to rediscover the design solutions themselves. The authors begin by describing what patterns are and how they can help you design object-oriented software. They then go on to systematically name, explain, evaluate, and catalog recurring designs in object-oriented systems. With Design Patterns as your guide, you will learn how these important patterns fit into the software development process, and how you can leverage them to solve your own design problems most efficiently.",
    "stock": 12,
    "image": "https://m.media-amazon.com/images/I/51szD9HC9pL._SX342_SY445_.jpg",
    "borrow_count": 0
  },
  {
    "title": "12 Habits Of Valuable Employees",
    "author": "Kevin Daum",
    "genre": "Business",
    "edition": "2nd",
    "description": "Are you looking to transform your career and achieve your full potential at work? Do you wish your employer recognized your talent and contributions more? This book reveals the insider secrets to becoming the most valued employee.",
    "stock": 12,
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1702497536i/203753360.jpg",
    "borrow_count": 0
  },

  {
    "title": "Jaded",
    "author": "Ela Lee",
    "genre": "thriller",
    "edition": "1st",
    "description": "A young lawyer wakes up the morning after a work gala with no memory of how she got home the previous night and must figure out what, exactly, happened—and how much she's willing to put up with to make her way to the top of the corporate ladder.",
    "stock": 12,
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1686502907i/176442986.jpg",
    "borrow_count": 0
  },
  {
    "title": "Calibrated Child",
    "author": "Sierra Nice",
    "genre": "",
    "edition": "2nd",
    "description": "",
    "stock": 12,
    "image": "",
    "borrow_count": 0
  }
]
